genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Publish CC1101 radio availability status for button enable/disable
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_availability", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "online" : "offline", true);
  delay(5);

  // Publish initial diagnostic metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "Idle" : "unavailable", true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/total_attempts", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/successful_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", failedReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/failed_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/last_error", mqttBaseTopic);
  mqtt.publish(topicBuffer, lastErrorMessage, true);
  delay(5);

  char freqBuffer[16];
  snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0); // Convert MHz to kHz
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, true);
  delay(5);

  Serial.println("[MQTT] MQTT config sent");

  // Publish initial Wi-Fi details
  publishWifiDetails();

  // Publish once the meter settings as set in the softeware
  publishMeterSettings();

  // Turn off LED to show everything is setup
  digitalWrite(LED_BUILTIN, HIGH); // turned off

  Serial.println("[STATUS] Setup done");
  Serial.println("================================\n");

  onScheduled();
}

// Function: saveFrequencyOffset
// Description: Saves the frequency offset to persistent storage (EEPROM for ESP8266, Preferences for ESP32)
void saveFrequencyOffset(float offset)
{
#if defined(ESP8266)
  // ESP8266: Use EEPROM
  uint16_t magic = FREQ_OFFSET_MAGIC;
  EEPROM.put(FREQ_OFFSET_ADDR, magic);
  EEPROM.put(FREQ_OFFSET_ADDR + 2, offset);
  EEPROM.commit();
  Serial.printf("[FREQ] Frequency offset %.6f MHz saved to EEPROM\n", offset);
#elif defined(ESP32)
  // ESP32: Use Preferences
  preferences.begin("everblu", false);
  preferences.putFloat("freq_offset", offset);
  preferences.end();
  Serial.printf("[FREQ] Frequency offset %.6f MHz saved to Preferences\n", offset);
#endif
  storedFrequencyOffset = offset;
}

// Function: loadFrequencyOffset
// Description: Loads the frequency offset from persistent storage, returns 0.0 if not found or invalid
float loadFrequencyOffset()
{
#if defined(ESP8266)
  // ESP8266: Use EEPROM
  uint16_t magic = 0;
  EEPROM.get(FREQ_OFFSET_ADDR, magic);
  if (magic == FREQ_OFFSET_MAGIC)
  {
    float offset = 0.0;
    EEPROM.get(FREQ_OFFSET_ADDR + 2, offset);
    // Sanity check: offset should be reasonable (within ±0.1 MHz)
    if (offset >= -0.1 && offset <= 0.1)
    {
      Serial.printf("[FREQ] Loaded frequency offset %.6f MHz from EEPROM\n", offset);
      return offset;
    }
    else
    {
      Serial.printf("[FREQ] Invalid frequency offset %.6f MHz in EEPROM, using 0.0\n", offset);
    }
  }
  else
  {
    Serial.println("[FREQ] No valid frequency offset found in EEPROM");
  }
#elif defined(ESP32)
  // ESP32: Use Preferences
  preferences.begin("everblu", true); // Read-only
  if (preferences.isKey("freq_offset"))
  {
    float offset = preferences.getFloat("freq_offset", 0.0);
    preferences.end();
    // Sanity check: offset should be reasonable (within ±0.1 MHz)
    if (offset >= -0.1 && offset <= 0.1)
    {
      Serial.printf("[FREQ] Loaded frequency offset %.6f MHz from Preferences\n", offset);
      return offset;
    }
    else
    {
      Serial.printf("[FREQ] Invalid frequency offset %.6f MHz in Preferences, using 0.0\n", offset);
    }
  }
  else
  {
    Serial.println("[FREQ] No frequency offset found in Preferences");
    preferences.end();
  }
#endif
  return 0.0;
}

// Function: performFastFrequencyScan
// Description: Scans ±150 kHz in coarse 10 kHz steps to quickly find the best signal and update the offset
void performFastFrequencyScan()
{
  Serial.println("[FREQ] Starting Fast frequency scan...");
  Serial.println("[FREQ] [NOTE] Wi-Fi/MQTT connections may temporarily drop and reconnect while the scan is running. This is expected.");

  // Suppress the verbose per-attempt radio/meter read logging for the whole
  // scan. Each frequency step performs a full read sequence whose detailed
  // output is irrelevant noise here; high-level scan progress messages remain.
  EchoDebugQuietGuard quietGuard;

  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Frequency Scanning", true);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Performing Fast frequency scan", true);

  float baseFreq = FREQUENCY;
  float bestFreq = baseFreq;
  int bestRSSI = -120; // Start with very low RSSI

  // Fast scan: ±150 kHz around the base frequency in coarse 10 kHz steps.
  // Same width as the Deep scan, but larger steps for speed.
  float scanStart = baseFreq - 0.15;
  float scanEnd = baseFreq + 0.15;
  float scanStep = 0.010;

  int fastStepCount = (int)roundf((scanEnd - scanStart) / scanStep) + 1;
  int fastEstSecs = fastStepCount * 3; // ~3 s per step (full radio TX+RX cycle)
  Serial.printf("[FREQ] Scanning from %.6f to %.6f MHz (%d steps, ~%d s / ~%d min)\n",
                scanStart, scanEnd, fastStepCount, fastEstSecs, (fastEstSecs + 30) / 60);

  for (float freq = scanStart; freq <= scanEnd; freq += scanStep)
  {
    FEED_WDT(); // Feed watchdog for each frequency step
    // Reinitialize CC1101 with this frequency
    cc1101_init(freq);
    delay(50); // Allow time for frequency to settle

    // Try to get meter data (with short timeout)
    struct tmeter_data test_data = get_meter_data();

    // Per-step progress so it is visible that every frequency was actually
    // tried. Without this the scan looks like it "did not run" because a
    // no-signal sweep produces no other output.
    Serial.printf("[FREQ] Freq %.6f MHz: RSSI=%d dBm, reads=%d\n",
                  freq, test_data.rssi_dbm, test_data.reads_counter);

