genestealer/everblu-meters-esp8266-improved/src/main.cpp
    if (test_data.rssi_dbm > bestRSSI && test_data.reads_counter > 0)
    {
      bestRSSI = test_data.rssi_dbm;
      bestFreq = freq;
      Serial.printf("[FREQ] Better signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
    }

    // Drain the WiFi serial ring buffer so remote logs stream live during the
    // scan instead of all arriving at once after it completes. Safe here: the
    // CC1101 RX phase for this step has already finished.
    wifiSerialLoop();
  }

  if (bestRSSI > -120)
  { // Only save if we found something
    float offset = bestFreq - baseFreq;
    Serial.printf("[FREQ] Fast scan complete. Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n",
                  bestFreq, offset, bestRSSI);

    saveFrequencyOffset(offset);

    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0); // Convert MHz to kHz
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
    mqtt.publish(topicBuffer, freqBuffer, true);

    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Fast scan complete: offset %.3f kHz, RSSI %d dBm", offset * 1000.0, bestRSSI);
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, statusMsg, true);

    // Reinitialize with the best frequency
    cc1101_init(bestFreq);
  }
  else
  {
    Serial.println("[FREQ] Fast scan complete - no meter signal found in scan range");
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, "Fast scan complete - no signal found", true);
    // Restore original frequency
    cc1101_init(baseFreq + storedFrequencyOffset);
  }

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "Idle" : "Not Connected", true);
}

// Function: performDeepFrequencyScan
// Description: Performs a thorough sweep across ±150 kHz around the configured frequency in fine
//              2.5 kHz steps. Same width as the Fast scan, but smaller steps for weak/off-frequency meters.
//              Also used on first boot to find the meter frequency automatically.
void performDeepFrequencyScan()
{
  Serial.println("[FREQ] Performing Deep frequency scan...");
  Serial.println("[FREQ] [NOTE] Wi-Fi/MQTT connections may temporarily drop and reconnect while the scan is running. This is expected.");

  // Suppress the verbose per-attempt radio/meter read logging for the whole
  // scan. Each frequency step performs a full read sequence whose detailed
  // output is irrelevant noise here; high-level scan progress messages remain.
  EchoDebugQuietGuard quietGuard;

  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Frequency Scanning", true);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Performing Deep frequency scan", true);

  float baseFreq = FREQUENCY;
  float bestFreq = baseFreq;
  int bestRSSI = -120;

  // Deep scan: same ±150 kHz width as the Fast scan, but fine 2.5 kHz steps
  // for a thorough sweep. Slower, but more likely to lock onto a weak or
  // off-frequency meter.
  float scanStart = baseFreq - 0.15;
  float scanEnd = baseFreq + 0.15;
  float scanStep = 0.0025;

  int deepStepCount = (int)roundf((scanEnd - scanStart) / scanStep) + 1;
  int deepEstSecs = deepStepCount * 3; // ~3 s per step (full radio TX+RX cycle)
  Serial.printf("[FREQ] Deep scan from %.6f to %.6f MHz (%d steps, ~%d s / ~%d min)\n",
                scanStart, scanEnd, deepStepCount, deepEstSecs, (deepEstSecs + 30) / 60);

  for (float freq = scanStart; freq <= scanEnd; freq += scanStep)
  {
    FEED_WDT(); // Feed watchdog for each frequency step

    // Check if CC1101 radio initialization succeeds before attempting communication
    if (!cc1101_init(freq))
    {
      Serial.println("[FREQ] CC1101 radio not responding - aborting Deep scan");
      Serial.println("[FREQ] Check: 1) Wiring connections 2) 3.3V power supply 3) SPI pins");
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, "ERROR: CC1101 radio not responding - cannot scan", true);
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
      mqtt.publish(topicBuffer, "Error", true);
      return; // Exit the scan immediately instead of continuing indefinitely
    }

    delay(100); // Longer delay for frequency to settle during Deep scan

    struct tmeter_data test_data = get_meter_data();

    Serial.printf("[FREQ] Freq %.6f MHz: RSSI=%d dBm, reads=%d\n", freq, test_data.rssi_dbm, test_data.reads_counter);

    if (test_data.rssi_dbm > bestRSSI && test_data.reads_counter > 0)
    {
      bestRSSI = test_data.rssi_dbm;
      bestFreq = freq;
      Serial.printf("[FREQ] Found signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
    }

    // Drain the WiFi serial ring buffer so remote logs stream live during the
    // scan instead of all arriving at once after it completes.
    wifiSerialLoop();
  }

  if (bestRSSI > -120)
  {
    float offset = bestFreq - baseFreq;
    Serial.printf("[FREQ] Deep scan complete! Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n",
                  bestFreq, offset, bestRSSI);

    saveFrequencyOffset(offset);

    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0); // Convert MHz to kHz
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
    mqtt.publish(topicBuffer, freqBuffer, true);

    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Deep scan complete: offset %.3f kHz", offset * 1000.0);
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, statusMsg, true);

    cc1101_init(bestFreq);
  }
  else
  {
    Serial.println("[FREQ] Deep scan failed - no meter signal found!");
    Serial.println("[FREQ] Please check:");
    Serial.println("[FREQ]  1. Meter is within range (< 50m typically)");
    Serial.println("[FREQ]  2. Antenna is connected to CC1101");
    Serial.println("[FREQ]  3. Meter serial/year are correct in private.h");
    Serial.println("[FREQ]  4. Current time is within meter's wake hours");
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, "Deep scan failed - check setup", true);
    cc1101_init(baseFreq);
  }

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "Idle" : "Not Connected", true);
}

// Function: adaptiveFrequencyTracking
// Description: Uses FREQEST register to adaptively adjust frequency offset over time
//              Accumulates frequency error estimates and adjusts when threshold is reached
void adaptiveFrequencyTracking(int8_t freqest)
{
  // FREQEST is a two's complement value representing frequency offset
  // Resolution is approximately Fxosc/2^14 ≈ 1.59 kHz per LSB (for 26 MHz crystal)
  const float FREQEST_TO_MHZ = 0.001587; // Conversion factor: ~1.59 kHz per LSB

  // Accumulate the frequency error
  float freqErrorMHz = (float)freqest * FREQEST_TO_MHZ;
  cumulativeFreqError += freqErrorMHz;
  successfulReadsBeforeAdapt++;

  Serial.printf("[FREQ] FREQEST: %d (%.4f kHz error), cumulative: %.4f kHz over %d reads\n",
                freqest, freqErrorMHz * 1000, cumulativeFreqError * 1000, successfulReadsBeforeAdapt);

  // Only adapt after N successful reads to avoid over-correcting on noise
  if (successfulReadsBeforeAdapt >= ADAPT_THRESHOLD)
  {
    float avgError = cumulativeFreqError / ADAPT_THRESHOLD;

    // Only adjust if average error is significant (> 2 kHz)
    if (abs(avgError * 1000) > 2.0)
    {
      Serial.printf("[FREQ] Adaptive adjustment: average error %.4f kHz over %d reads\n",
                    avgError * 1000, ADAPT_THRESHOLD);

      // Adjust the stored offset (apply 50% of the measured error to avoid over-correction)
      float adjustment = avgError * 0.5;
      storedFrequencyOffset += adjustment;

      Serial.printf("[FREQ] Adjusting frequency offset by %.6f MHz (new offset: %.6f MHz)\n",
                    adjustment, storedFrequencyOffset);

      saveFrequencyOffset(storedFrequencyOffset);

      char freqBuffer[16];
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0); // Convert MHz to kHz
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
      mqtt.publish(topicBuffer, freqBuffer, true);

      // Reinitialize CC1101 with adjusted frequency
      cc1101_init(FREQUENCY + storedFrequencyOffset);
    }
    else
    {
      Serial.printf("[FREQ] Frequency stable (avg error %.4f kHz < 2 kHz threshold)\n", avgError * 1000);
    }

    // Reset accumulators
    cumulativeFreqError = 0.0;
    successfulReadsBeforeAdapt = 0;
  }
}

/**
 * @brief Validate configuration parameters
 *
 * Performs startup validation of configuration parameters to fail fast
 * on invalid settings. Checks:
 * - METER_CODE (must parse to non-zero serial within 24-bit protocol limit)
 * - FREQUENCY (must be 300-500 MHz if defined)
 * - READING_HOUR/MINUTE (must be valid time)
 * - Reading schedule string format
 *
 * Logs validation results to serial console with ✓ or ERROR markers.
 *
 * @return true if all validations passed, false if any parameter is invalid
 */
bool validateConfiguration()
{
  bool valid = true;
  uint8_t parsed_year = 0;
  uint32_t parsed_serial = 0;

  Serial.println("\n=== Configuration Validation ===");

